Revit 2024 API
ModuleSettings Class
 The module settings.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class ModuleSettings : IDisposable
Visual Basic
Public Class ModuleSettings _
	Implements IDisposable
Visual C++
public ref class ModuleSettings : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Macros.ModuleSettings
See Also
ModuleSettings Members
Autodesk.Revit.DB.Macros Namespace